{
	"browser-title": "George's Home",
	"title": "Hello there",
	"subtitle": "Thanks for stopping by",
	"intro-paragraph": "I'm George, a final year computer science student based in Manchester",
	"about-me": "About Me",
	"projects-title": "Projects",
	"view-details": "View details",
	"about": "About me",
	"academic-title": "Academic",
	"academic-paragraphs": [
		"I'm in my final year studying for my Computer Science MEng(Hons) at The University of Manchester.",
		"In first year I won the Netcraft Prize for the top 10 students with an average of 90%. In second year I continued to do well and was in the <a href=\"https://www.georgegrainger.com/SecondYearLetter.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">top 5% of students</a> (of 400) with an average of 89%. I also achieved the top grade in System Architecture with an average of 92%.",
		"I enjoy a range of course units, particularly those based around AI, Data Engineering and Software Development. I particularly enjoyed seeing how these interacted in my third-year project simulating the dopamine system and addiction through reinforcement learning - <a href=\"projects/reinforcement-learning\">view details</a>."
	],
	"experience-title": "Experience",
	"imago-paragraphs": [
		"I'm currently working for Imago Software on the Melontech Phase III. This project assists diabetes patients in tracking their glucose levels by analysing their sensor data and predicting hypoglycemic (low blood sugar) events. With this information, the patient can then act to increase their glucose intake around this time, mitigating any risks.",
		"To create the system, we used a microservices architecture built in Flask and deployed on Amazon EC2 through Docker containers. The services interact with one another, periodically fetching and processing the data, before sending feedback via the WhatsApp API.",
		"Learning how Docker and microservices architectures can ensure scalability and reliable deployments across diverse systems has been very informative. I'm keen to further this knowledge in my own personal projects by exploring orchestration tools such as Kubernetes and Docker Swarm."
	],
	"nimble-paragraphs": [
		"Between June and September I worked on the <a href=\"\">NimbleAI project</a> at the University of Manchester. This invloved designing and implementing neuromorphic accelerators for the early perception and optimisation stage for computer vision systems in power and area constrained endpoints.",
		"Overall, the experience was extremely rewarding, providing exposure to working in an iterative and test-focused development environment. The focus on low power and high performance demonstrated a need to prioritise design features to ensure the project progressed and deliverables could be achieved successfully.",
		"The internship was primarily focused on software-driven hardware implementation, however, it also developed transferable knowledge in CI/CD pipelines, Docker Containers and scripting tools. Much of this resulted from UoM experiencing a Cyber Attack during the early period of this work, preventing access from the machines hosting the EDA tools. Ultimately, I had to take greater ownership of my work and adapt to an uncertainty, experiences that will benefit my future career."
	],
	"enigma-paragraphs": [
		"I spent a year working as a junior developer at <a href=\"https://www.enigma-interactive.co.uk\" target=\"_blank\" rel=\"noopener noreferrer\">Enigma Interactive</a>. During this time I had three main projects:"
	],
	"enigma-roles": [
		"Contributing to the 'core team', this involved programming in Java and building the base framework upon which other sites were developed.",
		"Developing a <a href=\"https://transplant-resource.newcastle-hospitals.nhs.uk\" target=\"_blank\" rel=\"noopener noreferrer\">heart and lung transplant resource</a> for Newcastle NHS foundation trust - <a href=\"projects/nhs-heart-and-lung\">view details</a>.",
		"Producing an educational game for Western Power, which taught children the potential dangers of power lines, and how to avoid them."
	],
	"interests-title": "Interests",
	"interests-paragraphs": [
		"In my free time, I enjoy keeping active and have played rugby all my life, taking a committee role at University. I particularly enjoy the team nature of the game, with everyone playing for and trusting each other.",
		"At University I took up climbing and surfing, enjoying the new challenges they bring. The problem-solving aspect of climbing is especially appealing, with the feeling of satisfaction being great after completing a tricky climb."
	],
	"spotify-tagline": "Information on my favourite songs and recent listening",
	"cv": "View my CV",
	"pause": "Pause",
	"play": "Play",
	"mute": "Mute",
	"unmute": "Unmute",
	"close": "Close",
	"spotify-logo": "Spotify logo",
	"spotify-sr-only": "Listen to {{title}} on Spotify",
	"currently-playing": "Currently Playing",
	"latest-song": "My Most Recent Song",
	"personal-favourite": "A Personal Favourite",
	"album-img-alt": "Album image for {{title}}",
	"played-on": "Played on {{date}} at {{time}}",
	"check-back": "Check back when I'm listening for a live feed",
	"current-intro": "I'm currently listening at...",
	"stick-around": "Stick around to see what I listen to next",
	"no-spotify": "Live Spotify data is unavailable ☹",
	"last-played-tagline": "Check when I'm online to see a live feed"
}
