{
	"browser-title": "La maison de George Grainger",
	"title": "Bonjour",
	"subtitle": "Merci d'être passé",
	"intro-paragraph": "Je m'appelle George, je suis un ingénieur logiciel qui travaille à Londres",
	"about-me": "Sur moi",
	"projects-title": "Projets",
	"view-details": "Voir les détails",
	"about": "Sur moi",
	"academic-title": "Académique",
	"academic-paragraphs": [
		"Je suis en dernière année d'études pour mon Master en informatique (Hons) à l'Université de Manchester.",
		"En première année, j'ai remporté le prix Netcraft pour les 10 meilleurs étudiants avec une moyenne de 90 %. En deuxième année, j'ai continué à bien faire et j'étais dans <a href=\"https://www.georgegrainger.com/SecondYearLetter.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">le top 5% des étudiants</a> (sur 400) avec une moyenne de 89%. J'ai également obtenu la meilleure note dans l'unité d'architecture système avec une moyenne de 92%.",
		"J'apprécie une gamme d'unités de cours, notamment celles basées sur l'IA, l'ingénierie des données et le développement logiciel. J'ai particulièrement apprécié de voir comment ceux-ci interagissaient dans mon projet de troisième année simulant le système dopaminergique et la dépendance grâce à l'apprentissage par renforcement - <a href=\"projects/reinforcement-learning\">voir les détails</a>."
	],
	"experience-title": "Expérience",
	"imago-paragraphs": [
		"Je travaille actuellement pour Imago Software sur Melontech Phase III. Ce projet aide les patients diabétiques à suivre leur taux de glucose en analysant les données de leurs capteurs et en prédisant les événements hypoglycémiques (faible taux de sucre dans le sang). Grâce à ces informations, le patient peut alors agir pour augmenter son apport en glucose à cette période, atténuant ainsi tout risque.",
		"Pour créer le système, nous avons utilisé une architecture de microservices construite dans Flask et déployée sur Amazon EC2 via des conteneurs Docker. Les services interagissent les uns avec les autres, récupérant et traitant périodiquement les données, avant d'envoyer des commentaires via l'API WhatsApp.",
		"Apprendre comment Docker et les architectures de microservices peuvent garantir l'évolutivité et des déploiements fiables sur divers systèmes a été très instructif. Je souhaite approfondir ces connaissances dans mes propres projets en explorant des outils d'orchestration tels que Kubernetes et Docker Swarm."
	],
	"nimble-paragraphs": [
		"Entre juin et septembre, j'ai travaillé sur le projet NimbleAI à l'Université de Manchester. Cela a permis de concevoir et de mettre en œuvre des accélérateurs neuromorphiques pour la phase précoce de perception et d'optimisation des systèmes de vision par ordinateur dans des dispositifs IOT avec une puissance et une surface limitées.",
		"Dans l'ensemble, l'expérience a été extrêmement enrichissante, car elle a permis de travailler dans un environnement de développement itératif et axé sur les tests. L'accent mis sur la faible consommation d'énergie et les hautes performances a démontré la nécessité de donner la priorité aux caractéristiques de conception pour s'assurer que le projet progresse et que les livrables puissent être atteints avec succès.",
		"Le stage était principalement axé sur la mise en œuvre de matériel piloté par logiciel, mais il a également développé des connaissances transférables sur les pipelines CI/CD, les conteneurs Docker et les outils de script. Cela résulte en grande partie du fait que l'UoM a subi une cyberattaque au début de ce travail, empêchant l'accès des machines hébergeant les outils EDA. En fin de compte, cela m'a obligé à m'approprier davantage mon travail et à m'adapter à un environnement incertain, une expérience qui sera bénéfique pour ma future carrière."
	],
	"enigma-paragraphs": [
		"J'ai passé un an à travailler en tant que développeur junior chez <a href=\"https://www.enigma-interactive.co.uk\" target=\"_blank\" rel=\"noopener noreferrer\">Enigma Interactive</a>. Durant cette période, j'avais trois projets principaux :"
	],
	"enigma-roles": [
		"Contribuer à «l'équipe de base», cela impliquait de programmer en Java et de construire le cadre de base sur lequel d'autres sites ont été développés.",
		"Développer une <a href=\"https://transplant-resource.newcastle-hospitals.nhs.uk\" target=\"_blank\" rel=\"noopener noreferrer\">ressource de transplantation cardiaque et pulmonaire</a> pour la confiance de la fondation Newcastle NHS - <a href=\"projects/nhs-heart-and-lung\">voir les détails</a>.",
		"Production d'un jeu éducatif pour Western Power, qui enseigne aux enfants les dangers potentiels des lignes électriques et comment les éviter."
	],
	"interests-title": "Intérêts",
	"interests-paragraphs": [
		"Dans mes temps libres, j'aime rester actif et j'ai joué au rugby toute ma vie, en tant que membre d'un comité à l'université. J'aime particulièrement la nature d'équipe du jeu, où tout le monde joue pour et se fait confiance.",
		"À l'université, j'ai commencé à faire de l'escalade et du surf, appréciant les nouveaux défis qu'ils apportent. L'aspect résolution de problèmes de l'escalade est particulièrement attrayant, le sentiment de satisfaction étant grand après avoir terminé une ascension difficile."
	],
	"cv": "Voir mon CV",
	"spotify-tagline": "Informations sur mes chansons récentes et préférées",
	"pause": "Mettre l'audio en pause",
	"play": "Lire l'audio",
	"mute": "Couper le son",
	"unmute": "Réactiver le son de l'audio",
	"close": "Fermez",
	"spotify-logo": "Spotify Logo",
	"spotify-sr-only": "Écoutez {{title}} sur Spotify",
	"currently-playing": "En cours de lecture",
	"latest-song": "Dernière chanson jouée",
	"personal-favourite": "Un favori personnel",
	"album-img-alt": "Image de l'album pour {{title}}",
	"played-on": "Joué le {{date}} à {{time}}",
	"check-back": "Revenez quand j'écoute un flux en direct",
	"current-intro": "J'écoute actuellement à...",
	"no-spotify": "Les données Spotify en direct ne sont pas disponibles ☹",
	"stick-around": "Reste dans le coin pour voir ce que j'écoute ensuite",
	"last-played-tagline": "Vérifier quand je suis en ligne pour voir un flux en direct"
}
